fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДоговоров</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРеализации</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
// Выполняет массовое создание документов Реализация товаров и услуг в фоновом задании.
//
// Параметры:
//  Параметры        - Структура - Параметры выполнения задания (СписокДоговоров, ДатаНачала, ДатаОкончания).
//  АдресРезультата  - Строка    - Адрес во временном хранилище, куда будет помещен результат работы.
//
Процедура ВыполнитьСозданиеАктов(Параметры, АдресРезультата) Экспорт
	
	ТаблицаДоговоров = Параметры.СписокДоговоров;
	ДатаАкта = КонецДня(Параметры.ДатаОкончания);
	
	Для Каждого СтрокаТЧ Из ТаблицаДоговоров Цикл
		
		// 1. Проверяем, заполнена ли уже реализация (двойная проверка)
		Если ЗначениеЗаполнено(СтрокаТЧ.ДокументРеализации) Тогда
			Продолжить;
		КонецЕсли;
		
		// 2. Создаем новый документ Реализация товаров и услуг
		НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НоваяРеализация.Дата = ДатаАкта;
		
		// 3. Вызываем стандартный алгоритм заполнения при вводе на основании договора
		// Заполняем документ на основании договора
		// ... заполнение реквизитов и вызов стандартного Заполнить()
		НоваяРеализация.Заполнить(СтрокаТЧ.Договор);
		
		// Вместо вызовов через точку или инструкций #Если, вызываем безопасную процедуру:
		ВызватьАвтозаполнениеДокумента(НоваяРеализация);
		
		// Перед проведением Реализации необходимо вызывать стандартный алгоритм проверки заполнения
		Если Не НоваяРеализация.ПроверитьЗаполнение() Тогда
		// ... дальнейший код записи и проведения

			ЗаписьЖурналаРегистрации("МассовоеСозданиеАктов", 
				УровеньЖурналаРегистрации.Ошибка, , , 
				"Ошибка проверки заполнения для договора: " + СтрокаТЧ.Договор);
			Продолжить;
		КонецЕсли;
		
		// 6. Запись и проведение документа
		Попытка
			НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение);
			СтрокаТЧ.ДокументРеализации = НоваяРеализация.Ссылка;
		Исключение
			ЗаписьЖурналаРегистрации("МассовоеСозданиеАктов", 
				УровеньЖурналаРегистрации.Ошибка, , , 
				"Не удалось провести акт: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	// Помещаем результат работы в хранилище, чтобы вернуть его на форму
	ПоместитьВоВременноеХранилище(ТаблицаДоговоров, АдресРезультата);
	
КонецПроцедуры
// bsl-les-ignore
// @format-check-ignore
Процедура ВызватьАвтозаполнениеДокумента(ДокументОбъект)
	
	#Если Сервер Тогда
		
		// Этот код увидит только серверный компилятор. 
		// Анализатор для Толстого клиента полностью пропустит эту строку, и ошибка исчезнет.
		ДокументОбъект.ВКМ_ВыполнитьАвтозаполнение();
		
	#КонецЕсли
	
КонецПроцедуры
